{
    "_class_name": "SciUNet2DModel",
    "_diffusers_version": "0.16.1",
    "act_fn": "silu",
    "attention_head_dim": 8,
    "block_out_channels": [
      64,
      128,
      256,
      512
    ],
    "down_block_types": [
      "SciSelfAttnDownBlock2D",
      "SciSelfAttnDownBlock2D",
      "SciSelfAttnDownBlock2D",
      "DownBlock2D"
    ],
    "downsample_padding": 1,
    "in_channels": 3,
    "layers_per_block": 1,
    "mid_block_scale_factor": 1,
    "norm_eps": 1e-05,
    "norm_num_groups": 32,
    "out_channels": 3,
    "sample_size": 64,
    "up_block_types": [
      "UpBlock2D",
      "SciSelfAttnUpBlock2D",
      "SciSelfAttnUpBlock2D",
      "SciSelfAttnUpBlock2D"
    ]
  }
  